## Clase 02
- Tipo de dato __dict__
- Pandas __group by__
- Cambios en los tipos de datos de las columnas:categórico(ordinal o no ordinal) a numérico, date a numérico

Al aplicar algoritmos de ML, es muy importante analizar los datos y prepararlos adecuadamente. A veces, algunos algoritmos, requieren que todas nuestras variables sean numéricas. Otros, admiten variables categóricas. 
Muchas veces tenemos que preprocesar texto o fechas y extraer información de ellas.

#### Empezamos con un nuevo tipo de dato
El tipo de datos __dictionary__ es muy utilizado especialmente por su parecido con JSON.<br>
Esta formado por pares __key:value__ encerrados entre {}. Este tipo de dato se puede asignar a una variable como "persona" en este caso.<br>
Creamos persona con nombre='Ana', de 30 años y soltera.<br>

In [1]:
persona={"nombre" :"Ana",
         "edad"   :30,
         "casado" :False}
#Cómo se puede observar cada par está separado por coma. Los datos del valor pueden 
#ser String, numéricos, boolean, etc.
print(persona)

{'nombre': 'Ana', 'edad': 30, 'casado': False}

Para __acceder__ a cada item dentro del dict indicamos el nombre de la key entre comillas y corchetes[]

In [2]:
#Accedemos a la edad de la persona
persona["nombre"]

'Ana'

Para __agregar__ otro par __key:value__ simplemente indicamos el nombre de la nueva key y el nuevo value. Si la key ya existía se va a sobreescribir el valor.

In [3]:
persona["apellido"]="Miranda"
print(persona)

{'nombre': 'Ana', 'edad': 30, 'casado': False, 'apellido': 'Miranda'}

Agregar al dict persona la entrada __ciudad:Azul__

In [4]:
#Agregar el par ciudad:Azul
persona['ciudad']='Azul'
persona

{'apellido': 'Miranda',
 'casado': False,
 'ciudad': 'Azul',
 'edad': 30,
 'nombre': 'Ana'}

Para copiar una variable a otra podemos asignarla directamente pero esto produce que ambas apunten al mismo espacio de memoria. Si queremos que sean independientes podemos usar la función <a href="https://docs.python.org/3/library/copy.html">__copy()__</a>.

In [5]:
pe=persona
pe

{'apellido': 'Miranda',
 'casado': False,
 'ciudad': 'Azul',
 'edad': 30,
 'nombre': 'Ana'}

Para __eliminar__ un item dentro del dict usamos la función __pop()__ o el comando __del__. En ambos casos debemos indicar la key que queremos eliminar.

In [6]:
#borramos la ciudad de persona
persona.pop("ciudad")
print(persona)
print(pe)

{'nombre': 'Ana', 'edad': 30, 'casado': False, 'apellido': 'Miranda'}
{'nombre': 'Ana', 'edad': 30, 'casado': False, 'apellido': 'Miranda'}

Observamos que tanto **pe** como **persona** perdieron el par *ciudad: Azul*.

Creamos un nuevo dict **pe** y lo **copiamos** en pe1

In [7]:
pe={'nombre': 'Ana', 'edad': 30, 'casado': False, 'ciudad': 'Azul'}
pe1=pe.copy()
pe.pop('ciudad')
print(pe)
print(pe1)

{'nombre': 'Ana', 'edad': 30, 'casado': False}
{'nombre': 'Ana', 'edad': 30, 'casado': False, 'ciudad': 'Azul'}

Ahora eliminamos el apellido de __persona__ usando __del__.

In [8]:
#del
del persona["apellido"]
print(persona)

{'nombre': 'Ana', 'edad': 30, 'casado': False}

Ejercicio: Crear otro dict, __persona2__ con los siguientes datos: Pablo, 28, soltero

In [10]:
#Crear persona2 con los siguientes datos: Pablo, 28,soltero
#-->
persona2={'nombre':'Pablo',
          'edad':28,
          'casado':False}
persona2

{'casado': False, 'edad': 28, 'nombre': 'Pablo'}

In [11]:
#Agregar a Ana el key "hermano" que tenga como contenido el dict de Pablo
persona['hermano']=persona2
persona

{'casado': False,
 'edad': 30,
 'hermano': {'casado': False, 'edad': 28, 'nombre': 'Pablo'},
 'nombre': 'Ana'}

In [12]:
#Acceder al nombre del hermano.La respuesta tiene que ser sólo Pablo, no todo el dict de Pablo
persona['hermano']['nombre']

'Pablo'

In [13]:
#Crear persona3 con los siguientes datos: Lucia, 32, casada
#-->
persona3={'nombre':'Lucia',
          'edad':32,
          'casado':True}

In [14]:
#Agregar a Lucia como otro hermano de Ana. Ejecutar y ver qué pasa
persona['hermano']=persona3
persona

{'casado': False,
 'edad': 30,
 'hermano': {'casado': True, 'edad': 32, 'nombre': 'Lucia'},
 'nombre': 'Ana'}

El __value__ un item puede ser una lista, el tipo de dato que vimos la clase pasada.<br>
Agregamos al dict persona la key __telefono__ con la lista de valores del los teléfonos de Ana.

In [15]:
persona["telefono"]=['111-2222','2222-4444','5555-6666']
print(persona)

{'nombre': 'Ana', 'edad': 30, 'casado': False, 'hermano': {'nombre': 'Lucia', 'edad': 32, 'casado': True}, 'telefono': ['111-2222', '2222-4444', '5555-6666']}

In [16]:
#Y lo accedemos indicando el key
print(persona['telefono'])
#Si solo queremos ver el primer teléfono tenemos que indicar el índice del array
print('El primer teléfono es: '+persona['telefono'][1])

['111-2222', '2222-4444', '5555-6666']
El primer teléfono es: 2222-4444

In [17]:
#Los elementos de un array pueden ser dic también. Creamos la lista hnos
hnos=[persona2,persona3]
print('Esta es la lista hnos ',hnos)
#Y ahora hacemos que el key hermano tenga esa lista
persona["hermano"]=hnos
persona

Esta es la lista hnos  [{'nombre': 'Pablo', 'edad': 28, 'casado': False}, {'nombre': 'Lucia', 'edad': 32, 'casado': True}]

{'casado': False,
 'edad': 30,
 'hermano': [{'casado': False, 'edad': 28, 'nombre': 'Pablo'},
  {'casado': True, 'edad': 32, 'nombre': 'Lucia'}],
 'nombre': 'Ana',
 'telefono': ['111-2222', '2222-4444', '5555-6666']}

In [18]:
#Acceder al nombre de la segunda hermana de Ana (por posición)
persona['hermano'][1]['nombre']

'Lucia'

In [20]:
#Imprimir los hermanos de persona
for p in persona['hermano']:
    print(p['nombre'])

Pablo
Lucia

### Condicional
__if__ condición1 __:__ [__elif__ _condición2_ __:__ ] .. [__else:__]
Si _condición1_ es Verdadero se ejecuta el bloque de comandos a continuación. Si está presente __elif__ se evalúa otra condición. Sino se ejecutan los comandos presentes en el __else__.
<br>
Vamos a mostrar solamente los datos del hermano de Ana que se llama Lucía.

In [21]:
#Imprimir sólo los datos del hermano que se llama Lucia
for p in persona['hermano']:
    if p['nombre']=='Lucia':
        print(p)
    else:
        print('este no es el hermano que queremos ver'+p['nombre'])

este no es el hermano que queremos verPablo
{'nombre': 'Lucia', 'edad': 32, 'casado': True}

In [22]:
#Imprimir los datos de los hermanos cuya edad sea menor que 30
for p in persona['hermano']:
    #-->
    if p['edad']<30:
        print(p)
    else:
        print('este no es el hermano que queremos ver'+p['nombre'])

{'nombre': 'Pablo', 'edad': 28, 'casado': False}
este no es el hermano que queremos verLucia

Podemos acceder a los keys y values de un dict usando los siguientes métodos:
- dict.keys()
- dict.values()
- dict.items()

Nos sirven mucho para iterar.

In [23]:
#Por ejemplo
print('items() -> ', persona.items())
print('\nkeys() ->', persona.keys())
print('\nvalues() -> ', persona.values())

items() ->  dict_items([('nombre', 'Ana'), ('edad', 30), ('casado', False), ('hermano', [{'nombre': 'Pablo', 'edad': 28, 'casado': False}, {'nombre': 'Lucia', 'edad': 32, 'casado': True}]), ('telefono', ['111-2222', '2222-4444', '5555-6666'])])

keys() -> dict_keys(['nombre', 'edad', 'casado', 'hermano', 'telefono'])

values() ->  dict_values(['Ana', 30, False, [{'nombre': 'Pablo', 'edad': 28, 'casado': False}, {'nombre': 'Lucia', 'edad': 32, 'casado': True}], ['111-2222', '2222-4444', '5555-6666']])

In [24]:
#Mostramos los pares key value de persona
for k,v in persona.items():
    print('El key es '+k + ' y su value es '+str(v))
    #Otra forma de armar la salida: usando el método format
    salida = 'El key es {0} y su value es {1}'.format(k,v)
    print(salida)

El key es nombre y su value es Ana
El key es nombre y su value es Ana
El key es edad y su value es 30
El key es edad y su value es 30
El key es casado y su value es False
El key es casado y su value es False
El key es hermano y su value es [{'nombre': 'Pablo', 'edad': 28, 'casado': False}, {'nombre': 'Lucia', 'edad': 32, 'casado': True}]
El key es hermano y su value es [{'nombre': 'Pablo', 'edad': 28, 'casado': False}, {'nombre': 'Lucia', 'edad': 32, 'casado': True}]
El key es telefono y su value es ['111-2222', '2222-4444', '5555-6666']
El key es telefono y su value es ['111-2222', '2222-4444', '5555-6666']

In [25]:
#Otra forma de crear un dict es usando el constructor
auto=dict(marca='Ford',modelo='Fiesta',año=2018)
print(auto)

{'marca': 'Ford', 'modelo': 'Fiesta', 'año': 2018}

In [26]:
auto['año']

2018

### Seguimos con más funciones de pandas
y las combinamos con lo visto sobre __dict__

In [27]:
import pandas as pd

In [28]:
per = {"edad":[28,34,56,21,45,27,34],# lista con siete números que representan edades
       "sueldo":[45000,78000,35000,100000,67000,35000,100000,],#crear una lista con siete números que representan sueldos
       "cargo":["Programador","Analista","Director","Analista jr.","Secretaria","Programador","Programador"],
       "Mayor18": True,#Colocar todos en True
       "genero":['F','M','M','F','F','M','F'],#crear una lista con siete valores 'F' o 'M'
       "estudios":['Terciario','Terciario','Postgrado','Universitario','Terciario','Universitario','Postgrado']}
per

{'Mayor18': True,
 'cargo': ['Programador',
  'Analista',
  'Director',
  'Analista jr.',
  'Secretaria',
  'Programador',
  'Programador'],
 'edad': [28, 34, 56, 21, 45, 27, 34],
 'estudios': ['Terciario',
  'Terciario',
  'Postgrado',
  'Universitario',
  'Terciario',
  'Universitario',
  'Postgrado'],
 'genero': ['F', 'M', 'M', 'F', 'F', 'M', 'F'],
 'sueldo': [45000, 78000, 35000, 100000, 67000, 35000, 100000]}

In [29]:
personas = pd.DataFrame(per)
personas

   edad  sueldo         cargo  Mayor18 genero       estudios
0    28   45000   Programador     True      F      Terciario
1    34   78000      Analista     True      M      Terciario
2    56   35000      Director     True      M      Postgrado
3    21  100000  Analista jr.     True      F  Universitario
4    45   67000    Secretaria     True      F      Terciario
5    27   35000   Programador     True      M  Universitario
6    34  100000   Programador     True      F      Postgrado

### Consultas con filtro

Podemos combinar varias condiciones con and __&__ u or __|__. Cada una tiene que estar entre paréntesis. El símbolo de igualdad es ==.
<br><br>
Mostrar las personas cuyo sueldo supera los 50000

In [31]:
personas[personas['sueldo']>50000]

   edad  sueldo         cargo  Mayor18 genero       estudios
1    34   78000      Analista     True      M      Terciario
3    21  100000  Analista jr.     True      F  Universitario
4    45   67000    Secretaria     True      F      Terciario
6    34  100000   Programador     True      F      Postgrado

Mostrar las mujeres con estudios Universitarios

In [39]:
personas[(personas['genero']=='F') & (personas['estudios']=='Universitario')]

   edad  sueldo         cargo  Mayor18 genero       estudios
3    21  100000  Analista jr.     True      F  Universitario

### GROUP BY

Mostrar los datos agrupados por una o más variables. De cada grupo podemos mostrar funciones de agregación como sum, count, avg
<br><br>
Mostrar cuantas mujeres y cuantos hombres hay

In [40]:
personas.groupby('genero').size()

genero
F    4
M    3
dtype: int64

In [41]:
#Calculamos el sueldo promedio por género
personas.groupby('genero')['sueldo'].mean()

genero
F    78000.000000
M    49333.333333
Name: sueldo, dtype: float64

In [42]:
#Calcular el sueldo promedio por cargo
personas.groupby('cargo')['sueldo'].mean()

cargo
Analista         78000.0
Analista jr.    100000.0
Director         35000.0
Programador      60000.0
Secretaria       67000.0
Name: sueldo, dtype: float64

In [43]:
personas.groupby(['cargo','genero']).size()

cargo         genero
Analista      M         1
Analista jr.  F         1
Director      M         1
Programador   F         2
              M         1
Secretaria    F         1
dtype: int64

In [45]:
dict(personas.groupby('genero')['sueldo'].sum())

{'F': 312000, 'M': 148000}

In [46]:
dict(personas.groupby('estudios').size()).keys()

dict_keys(['Postgrado', 'Terciario', 'Universitario'])

### Pasar las variables categóricas sin jerarquía a números

Función <a href="https://pandas.pydata.org/docs/reference/api/pandas.get_dummies.html"> __get_dummies__</a>

In [47]:
pd.get_dummies(personas['genero'])

   F  M
0  1  0
1  0  1
2  0  1
3  1  0
4  1  0
5  0  1
6  1  0

In [48]:
persona_num=pd.concat([personas, pd.get_dummies(personas['genero'])],axis=1)
persona_num

   edad  sueldo         cargo  Mayor18 genero       estudios  F  M
0    28   45000   Programador     True      F      Terciario  1  0
1    34   78000      Analista     True      M      Terciario  0  1
2    56   35000      Director     True      M      Postgrado  0  1
3    21  100000  Analista jr.     True      F  Universitario  1  0
4    45   67000    Secretaria     True      F      Terciario  1  0
5    27   35000   Programador     True      M  Universitario  0  1
6    34  100000   Programador     True      F      Postgrado  1  0

__drop__ permite eliminar una fila (axis=0) o columna (axis=1). 
<br>Borramos la columna género

In [49]:
personas.drop(['genero'],axis=1)

   edad  sueldo         cargo  Mayor18       estudios
0    28   45000   Programador     True      Terciario
1    34   78000      Analista     True      Terciario
2    56   35000      Director     True      Postgrado
3    21  100000  Analista jr.     True  Universitario
4    45   67000    Secretaria     True      Terciario
5    27   35000   Programador     True  Universitario
6    34  100000   Programador     True      Postgrado

In [50]:
personas

   edad  sueldo         cargo  Mayor18 genero       estudios
0    28   45000   Programador     True      F      Terciario
1    34   78000      Analista     True      M      Terciario
2    56   35000      Director     True      M      Postgrado
3    21  100000  Analista jr.     True      F  Universitario
4    45   67000    Secretaria     True      F      Terciario
5    27   35000   Programador     True      M  Universitario
6    34  100000   Programador     True      F      Postgrado

In [51]:
personas_sg=personas.drop(['genero'],axis=1)
personas_sg

   edad  sueldo         cargo  Mayor18       estudios
0    28   45000   Programador     True      Terciario
1    34   78000      Analista     True      Terciario
2    56   35000      Director     True      Postgrado
3    21  100000  Analista jr.     True  Universitario
4    45   67000    Secretaria     True      Terciario
5    27   35000   Programador     True  Universitario
6    34  100000   Programador     True      Postgrado

In [52]:
personas.drop([1],axis=0)

   edad  sueldo         cargo  Mayor18 genero       estudios
0    28   45000   Programador     True      F      Terciario
2    56   35000      Director     True      M      Postgrado
3    21  100000  Analista jr.     True      F  Universitario
4    45   67000    Secretaria     True      F      Terciario
5    27   35000   Programador     True      M  Universitario
6    34  100000   Programador     True      F      Postgrado

In [53]:
per=personas.set_index('cargo')
per

              edad  sueldo  Mayor18 genero       estudios
cargo
Programador     28   45000     True      F      Terciario
Analista        34   78000     True      M      Terciario
Director        56   35000     True      M      Postgrado
Analista jr.    21  100000     True      F  Universitario
Secretaria      45   67000     True      F      Terciario
Programador     27   35000     True      M  Universitario
Programador     34  100000     True      F      Postgrado

In [54]:
per.drop('Programador',axis=0)

              edad  sueldo  Mayor18 genero       estudios
cargo
Analista        34   78000     True      M      Terciario
Director        56   35000     True      M      Postgrado
Analista jr.    21  100000     True      F  Universitario
Secretaria      45   67000     True      F      Terciario

In [55]:
per['edad']['Analista']

34

### Ordenamiento
__sort_values  by__ permite mostrar los datos ordenados

In [57]:
personas.sort_values(by=['sueldo'],ascending=False)
#Probar con el parámetro ascending=False,

   edad  sueldo         cargo  Mayor18 genero       estudios
3    21  100000  Analista jr.     True      F  Universitario
6    34  100000   Programador     True      F      Postgrado
1    34   78000      Analista     True      M      Terciario
4    45   67000    Secretaria     True      F      Terciario
0    28   45000   Programador     True      F      Terciario
2    56   35000      Director     True      M      Postgrado
5    27   35000   Programador     True      M  Universitario

In [59]:
#ordenar por cargo y edad
personas.sort_values(by=['cargo','edad'],ascending=[False,True])

   edad  sueldo         cargo  Mayor18 genero       estudios
4    45   67000    Secretaria     True      F      Terciario
5    27   35000   Programador     True      M  Universitario
0    28   45000   Programador     True      F      Terciario
6    34  100000   Programador     True      F      Postgrado
2    56   35000      Director     True      M      Postgrado
3    21  100000  Analista jr.     True      F  Universitario
1    34   78000      Analista     True      M      Terciario

# Para practicar

1. Leer el archivo csv **europe.csv** en un dataframe llamado **eur**

In [2]:
import pandas as pd
eur=pd.read_csv('europe.csv')
eur

,Country,Area,GDP,Inflation,Life.expect,Military,Pop.growth,Unemployment
0,Austria,83871,41600,3.5,79.91,0.80,0.03,4.2
1,Belgium,30528,37800,3.5,79.65,1.30,0.06,7.2
2,Bulgaria,110879,13800,4.2,73.84,2.60,-0.80,9.6
3,Croatia,56594,18000,2.3,75.99,2.39,-0.09,17.7
4,Czech Republic,78867,27100,1.9,77.38,1.15,-0.13,8.5
5,Denmark,43094,37000,2.8,78.78,1.30,0.24,6.1
6,Estonia,45228,20400,5.0,73.58,2.00,-0.65,12.5
7,Finland,338145,36000,3.3,79.41,2.00,0.07,7.8
8,Germany,357022,38100,2.5,80.19,1.50,-0.20,6.0
9,Greece,131957,26300,3.3,80.05,4.30,0.06,17.4
10,Hungary,93028,19600,3.9,75.02,1.75,-0.18,10.9
11,Iceland,103000,38100,4.0,81.00,0.00,0.67,7.4
12,Ireland,70273,40800,2.6,80.32,0.90,1.11,14.4
13,Italy,301340,30500,2.9,81.86,1.80,0.38,8.4
14,Latvia,64589,16800,4.4,72.93,1.10,-0.60,12.8
15,Lithuania,65300,19100,4.1,75.55,0.90,-0.28,15.4
16,Luxembourg,2586,80600,3.4,79.75,0.90,1.14,5.7
17,Netherlands,41543,42000,2.3,80.91,1.60,0.45,4.4
18,Norway,323802,53400,1.3,80.32,1.90,0.33,3.3
19,Poland,312685,20200,4.2,76.25,1.90,-0.08,12.4
20,Portugal,92090,23400,3.7,78.70,2.30,0.18,12.7
21,Slovakia,49035,23300,3.9,76.03,1.08,0.10,13.2
22,Slovenia,20273,28800,1.8,77.48,1.70,-0.19,11.8
23,Spain,505370,30500,3.1,81.27,1.20,0.65,21.7
24,Sweden,450295,40700,3.0,81.18,1.50,0.17,7.5
25,Switzerland,41277,44500,0.2,81.17,1.00,0.92,2.8
26,Ukraine,603550,7200,8.0,68.74,1.40,-0.63,7.9
27,United Kingdom,243610,36500,4.5,80.17,2.70,0.55,8.1

2. Mostrar solo las filas de los países cuya desempleo es mayor que 15

In [3]:
eur[ eur["Unemployment"]>15 ]

,Country,Area,GDP,Inflation,Life.expect,Military,Pop.growth,Unemployment
3,Croatia,56594,18000,2.3,75.99,2.39,-0.09,17.7
9,Greece,131957,26300,3.3,80.05,4.30,0.06,17.4
15,Lithuania,65300,19100,4.1,75.55,0.90,-0.28,15.4
23,Spain,505370,30500,3.1,81.27,1.20,0.65,21.7

3. Mostrar aquellos países cuyo PBI (GPD) sea mayor que 30000 y con crecimiento poblacional negativo.

In [5]:
eur[ (eur["GDP"]>30000) & (eur["Pop.growth"]<=0) ]

,Country,Area,GDP,Inflation,Life.expect,Military,Pop.growth,Unemployment
8,Germany,357022,38100,2.5,80.19,1.5,-0.2,6.0

4. Mostrar todos los países ordenados por Inflación (ascendente)y luego por desempleo (descendente). Utiliza el parámetro __ascending__=[]**texto en negrita**

In [6]:
eur.sort_values(by=['Inflation','Unemployment'],ascending=[True,False])

,Country,Area,GDP,Inflation,Life.expect,Military,Pop.growth,Unemployment
25,Switzerland,41277,44500,0.2,81.17,1.00,0.92,2.8
18,Norway,323802,53400,1.3,80.32,1.90,0.33,3.3
22,Slovenia,20273,28800,1.8,77.48,1.70,-0.19,11.8
4,Czech Republic,78867,27100,1.9,77.38,1.15,-0.13,8.5
3,Croatia,56594,18000,2.3,75.99,2.39,-0.09,17.7
17,Netherlands,41543,42000,2.3,80.91,1.60,0.45,4.4
8,Germany,357022,38100,2.5,80.19,1.50,-0.20,6.0
12,Ireland,70273,40800,2.6,80.32,0.90,1.11,14.4
5,Denmark,43094,37000,2.8,78.78,1.30,0.24,6.1
13,Italy,301340,30500,2.9,81.86,1.80,0.38,8.4
24,Sweden,450295,40700,3.0,81.18,1.50,0.17,7.5
23,Spain,505370,30500,3.1,81.27,1.20,0.65,21.7
9,Greece,131957,26300,3.3,80.05,4.30,0.06,17.4
7,Finland,338145,36000,3.3,79.41,2.00,0.07,7.8
16,Luxembourg,2586,80600,3.4,79.75,0.90,1.14,5.7
1,Belgium,30528,37800,3.5,79.65,1.30,0.06,7.2
0,Austria,83871,41600,3.5,79.91,0.80,0.03,4.2
20,Portugal,92090,23400,3.7,78.70,2.30,0.18,12.7
21,Slovakia,49035,23300,3.9,76.03,1.08,0.10,13.2
10,Hungary,93028,19600,3.9,75.02,1.75,-0.18,10.9
11,Iceland,103000,38100,4.0,81.00,0.00,0.67,7.4
15,Lithuania,65300,19100,4.1,75.55,0.90,-0.28,15.4
19,Poland,312685,20200,4.2,76.25,1.90,-0.08,12.4
2,Bulgaria,110879,13800,4.2,73.84,2.60,-0.80,9.6
14,Latvia,64589,16800,4.4,72.93,1.10,-0.60,12.8
27,United Kingdom,243610,36500,4.5,80.17,2.70,0.55,8.1
6,Estonia,45228,20400,5.0,73.58,2.00,-0.65,12.5
26,Ukraine,603550,7200,8.0,68.74,1.40,-0.63,7.9

5. Agrupar por el valor de inflación redondeado y mostrar el promedio del PBI para cada grupo.

In [7]:
eur.groupby('Inflation')['GDP'].mean()

Inflation
0.2    44500.0
1.3    53400.0
1.8    28800.0
1.9    27100.0
2.3    30000.0
2.5    38100.0
2.6    40800.0
2.8    37000.0
2.9    30500.0
3.0    40700.0
3.1    30500.0
3.3    31150.0
3.4    80600.0
3.5    39700.0
3.7    23400.0
3.9    21450.0
4.0    38100.0
4.1    19100.0
4.2    17000.0
4.4    16800.0
4.5    36500.0
5.0    20400.0
8.0     7200.0
Name: GDP, dtype: float64